@Gowiem OK, done. This code:

```
module "vpc" {
  source = "git::https://github.com/dboesswetter/terraform-aws-vpc.git"
  namespace = "dabo"
  stage = "testing"
  name = "main"
  cidr_block = "10.11.12.0/24"
  tags = {
    Name = "will be overridden",
    foo = "bar"
  }
}
```

will yield this plan:

```
  # module.vpc.aws_default_security_group.default[0] will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = []
      + id                     = (known after apply)
      + ingress                = []
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"      = "Default Security Group"
          + "Namespace" = "dabo"
          + "Stage"     = "testing"
          + "foo"       = "bar"
        }
      + vpc_id                 = (known after apply)
    }
```